fio/results/shyper.log
sequential-fill: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
seq-read-1: (g=1): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
seq-read-2: (g=2): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=2
random-write-16: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
random-write-16x8: (g=4): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
random-read-16: (g=5): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
random-read-16x8: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
mixed-random-rw-32x8: (g=7): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.1
Starting 29 threads

sequential-fill: (groupid=0, jobs=1): err= 0: pid=8523: Thu Jul 14 16:16:36 2022
  Description  : [Sequential fill phase]
  write: IOPS=397, BW=397MiB/s (417MB/s)(16.0GiB/41245msec)
    slat (usec): min=236, max=38124, avg=423.91, stdev=869.48
    clat (msec): min=6, max=103, avg=39.84, stdev= 3.27
     lat (msec): min=7, max=111, avg=40.26, stdev= 3.24
    clat percentiles (msec):
     |  1.00th=[   33],  5.00th=[   40], 10.00th=[   40], 20.00th=[   40],
     | 30.00th=[   40], 40.00th=[   40], 50.00th=[   40], 60.00th=[   40],
     | 70.00th=[   40], 80.00th=[   41], 90.00th=[   41], 95.00th=[   41],
     | 99.00th=[   45], 99.50th=[   63], 99.90th=[   77], 99.95th=[   88],
     | 99.99th=[  102]
   bw (  KiB/s): min=298303, max=407153, per=85.33%, avg=347104.79, stdev=8662.38, samples=82
   iops        : min=  291, max=  397, avg=338.70, stdev= 8.44, samples=82
  lat (msec)   : 10=0.07%, 20=0.29%, 50=98.82%, 100=0.81%, 250=0.01%
  cpu          : usr=2.63%, sys=10.64%, ctx=17126, majf=1, minf=112
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,16384,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
seq-read-1: (groupid=1, jobs=1): err= 0: pid=8548: Thu Jul 14 16:16:36 2022
   read: IOPS=329, BW=329MiB/s (345MB/s)(16.0GiB/49779msec)
    slat (usec): min=253, max=5091, avg=262.77, stdev=67.05
    clat (usec): min=6, max=6286, avg=2772.42, stdev=79.05
     lat (usec): min=3002, max=7925, avg=3035.63, stdev=94.37
    clat percentiles (usec):
     |  1.00th=[ 2704],  5.00th=[ 2769], 10.00th=[ 2769], 20.00th=[ 2769],
     | 30.00th=[ 2769], 40.00th=[ 2769], 50.00th=[ 2769], 60.00th=[ 2769],
     | 70.00th=[ 2769], 80.00th=[ 2769], 90.00th=[ 2769], 95.00th=[ 2769],
     | 99.00th=[ 2868], 99.50th=[ 3130], 99.90th=[ 3621], 99.95th=[ 4228],
     | 99.99th=[ 6259]
   bw (  KiB/s): min=293404, max=337454, per=95.66%, avg=322419.54, stdev=4986.88, samples=99
   iops        : min=  286, max=  329, avg=314.37, stdev= 4.85, samples=99
  lat (usec)   : 10=0.01%
  lat (msec)   : 2=0.01%, 4=99.92%, 10=0.06%
  cpu          : usr=0.06%, sys=4.47%, ctx=17058, majf=0, minf=256
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=16384,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
seq-read-2: (groupid=2, jobs=1): err= 0: pid=8594: Thu Jul 14 16:16:36 2022
   read: IOPS=396, BW=396MiB/s (415MB/s)(16.0GiB/41372msec)
    slat (usec): min=225, max=5297, avg=248.28, stdev=61.85
    clat (usec): min=346, max=10132, avg=4798.47, stdev=252.60
     lat (usec): min=3253, max=10388, avg=5047.18, stdev=250.94
    clat percentiles (usec):
     |  1.00th=[ 4015],  5.00th=[ 4359], 10.00th=[ 4555], 20.00th=[ 4752],
     | 30.00th=[ 4752], 40.00th=[ 4817], 50.00th=[ 4817], 60.00th=[ 4817],
     | 70.00th=[ 4817], 80.00th=[ 4817], 90.00th=[ 5080], 95.00th=[ 5211],
     | 99.00th=[ 5538], 99.50th=[ 5604], 99.90th=[ 6063], 99.95th=[ 7177],
     | 99.99th=[10159]
   bw (  KiB/s): min=272131, max=402035, per=69.31%, avg=281057.87, stdev=13608.39, samples=82
   iops        : min=  265, max=  392, avg=273.96, stdev=13.29, samples=82
  lat (usec)   : 500=0.01%
  lat (msec)   : 4=0.70%, 10=99.29%, 20=0.01%
  cpu          : usr=0.12%, sys=4.89%, ctx=17301, majf=0, minf=256
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=16384,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2
random-write-16: (groupid=3, jobs=1): err= 0: pid=8595: Thu Jul 14 16:16:36 2022
  Description  : [Random write steady state phase]
  write: IOPS=37.8k, BW=148MiB/s (155MB/s)(8863MiB/60001msec)
    slat (usec): min=12, max=8124, avg=21.20, stdev=15.94
    clat (usec): min=71, max=8576, avg=398.92, stdev=78.24
     lat (usec): min=91, max=8597, avg=420.49, stdev=80.78
    clat percentiles (usec):
     |  1.00th=[  383],  5.00th=[  383], 10.00th=[  383], 20.00th=[  383],
     | 30.00th=[  383], 40.00th=[  388], 50.00th=[  388], 60.00th=[  392],
     | 70.00th=[  392], 80.00th=[  392], 90.00th=[  433], 95.00th=[  445],
     | 99.00th=[  652], 99.50th=[  660], 99.90th=[  750], 99.95th=[ 1287],
     | 99.99th=[ 4555]
   bw (  KiB/s): min=76893, max=132089, per=85.53%, avg=129381.34, stdev=6457.46, samples=119
   iops        : min=19223, max=33022, avg=32344.98, stdev=1614.33, samples=119
  lat (usec)   : 100=0.01%, 250=0.01%, 500=97.48%, 750=2.41%, 1000=0.03%
  lat (msec)   : 2=0.05%, 4=0.01%, 10=0.01%
  cpu          : usr=17.34%, sys=80.09%, ctx=7596, majf=0, minf=5
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2269015,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
random-write-16x8: (groupid=4, jobs=8): err= 0: pid=8596: Thu Jul 14 16:16:36 2022
  Description  : [Random write steady state phase]
  write: IOPS=36.4k, BW=142MiB/s (149MB/s)(8526MiB/60009msec)
    slat (usec): min=12, max=84039, avg=192.27, stdev=1882.75
    clat (usec): min=36, max=84423, avg=3310.26, stdev=8535.85
     lat (usec): min=88, max=84444, avg=3504.57, stdev=8751.10
    clat percentiles (usec):
     |  1.00th=[  383],  5.00th=[  388], 10.00th=[  388], 20.00th=[  392],
     | 30.00th=[  396], 40.00th=[  400], 50.00th=[  400], 60.00th=[  404],
     | 70.00th=[  404], 80.00th=[  408], 90.00th=[18220], 95.00th=[28443],
     | 99.00th=[32375], 99.50th=[32637], 99.90th=[44303], 99.95th=[56361],
     | 99.99th=[60556]
   bw (  KiB/s): min= 9183, max=18232, per=10.98%, avg=15971.04, stdev=1055.23, samples=952
   iops        : min= 2295, max= 4558, avg=3992.40, stdev=263.83, samples=952
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.01%, 500=87.88%, 750=1.00%
  lat (usec)   : 1000=0.04%
  lat (msec)   : 2=0.01%, 4=0.07%, 10=0.38%, 20=0.73%, 50=9.82%
  lat (msec)   : 100=0.07%
  cpu          : usr=2.26%, sys=9.91%, ctx=36580, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2182558,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
random-read-16: (groupid=5, jobs=1): err= 0: pid=8606: Thu Jul 14 16:16:36 2022
  Description  : [Random read steady state phase]
   read: IOPS=36.4k, BW=142MiB/s (149MB/s)(8542MiB/60001msec)
    slat (usec): min=10, max=6010, avg=21.68, stdev=14.83
    clat (usec): min=123, max=6888, avg=414.20, stdev=62.38
     lat (usec): min=143, max=6909, avg=436.31, stdev=64.03
    clat percentiles (usec):
     |  1.00th=[  347],  5.00th=[  355], 10.00th=[  359], 20.00th=[  371],
     | 30.00th=[  383], 40.00th=[  396], 50.00th=[  408], 60.00th=[  416],
     | 70.00th=[  433], 80.00th=[  449], 90.00th=[  478], 95.00th=[  502],
     | 99.00th=[  578], 99.50th=[  603], 99.90th=[  660], 99.95th=[ 1254],
     | 99.99th=[ 1516]
   bw (  KiB/s): min=103607, max=145294, per=96.76%, avg=141065.24, stdev=5442.78, samples=119
   iops        : min=25901, max=36323, avg=35265.97, stdev=1360.70, samples=119
  lat (usec)   : 250=0.01%, 500=94.62%, 750=5.32%, 1000=0.01%
  lat (msec)   : 2=0.05%, 4=0.01%, 10=0.01%
  cpu          : usr=15.23%, sys=71.83%, ctx=20579, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=2186831,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
random-read-16x8: (groupid=6, jobs=8): err= 0: pid=8607: Thu Jul 14 16:16:36 2022
  Description  : [Random read steady state phase]
   read: IOPS=35.9k, BW=140MiB/s (147MB/s)(8417MiB/60009msec)
    slat (usec): min=10, max=83750, avg=184.15, stdev=1842.61
    clat (usec): min=4, max=92577, avg=3359.65, stdev=7299.86
     lat (usec): min=101, max=92642, avg=3546.65, stdev=7471.27
    clat percentiles (usec):
     |  1.00th=[  347],  5.00th=[  359], 10.00th=[  363], 20.00th=[  375],
     | 30.00th=[  388], 40.00th=[  400], 50.00th=[  412], 60.00th=[  429],
     | 70.00th=[  453], 80.00th=[  515], 90.00th=[14222], 95.00th=[22676],
     | 99.00th=[31065], 99.50th=[32637], 99.90th=[38536], 99.95th=[40633],
     | 99.99th=[53740]
   bw (  KiB/s): min= 7910, max=19529, per=11.52%, avg=16542.45, stdev=2562.62, samples=957
   iops        : min= 1977, max= 4882, avg=4135.31, stdev=640.66, samples=957
  lat (usec)   : 10=0.01%, 100=0.01%, 250=0.01%, 500=78.61%, 750=3.16%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.09%, 4=0.81%, 10=4.16%, 20=6.23%, 50=6.92%
  lat (msec)   : 100=0.02%
  cpu          : usr=2.02%, sys=8.72%, ctx=28645, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=2154689,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
mixed-random-rw-32x8: (groupid=7, jobs=8): err= 0: pid=8675: Thu Jul 14 16:16:36 2022
   read: IOPS=19.5k, BW=76.3MiB/s (79.0MB/s)(4576MiB/60005msec)
    slat (usec): min=10, max=9808, avg=295.06, stdev=183.41
    clat (usec): min=126, max=36596, avg=8909.52, stdev=1398.12
     lat (usec): min=138, max=37064, avg=9205.13, stdev=1433.13
    clat percentiles (usec):
     |  1.00th=[ 5407],  5.00th=[ 6718], 10.00th=[ 7308], 20.00th=[ 7963],
     | 30.00th=[ 8356], 40.00th=[ 8586], 50.00th=[ 8848], 60.00th=[ 9110],
     | 70.00th=[ 9503], 80.00th=[ 9896], 90.00th=[10421], 95.00th=[11076],
     | 99.00th=[12780], 99.50th=[13566], 99.90th=[16909], 99.95th=[18744],
     | 99.99th=[26870]
   bw (  KiB/s): min= 7320, max=10589, per=12.53%, avg=9785.54, stdev=406.45, samples=958
   iops        : min= 1830, max= 2647, avg=2446.09, stdev=101.65, samples=958
  write: IOPS=8339, BW=32.6MiB/s (34.2MB/s)(1955MiB/60005msec)
    slat (usec): min=12, max=10016, avg=243.05, stdev=177.72
    clat (usec): min=143, max=36875, avg=8888.30, stdev=1405.87
     lat (usec): min=156, max=37182, avg=9132.12, stdev=1402.28
    clat percentiles (usec):
     |  1.00th=[ 5342],  5.00th=[ 6718], 10.00th=[ 7308], 20.00th=[ 7898],
     | 30.00th=[ 8291], 40.00th=[ 8586], 50.00th=[ 8848], 60.00th=[ 9110],
     | 70.00th=[ 9503], 80.00th=[ 9896], 90.00th=[10421], 95.00th=[11076],
     | 99.00th=[12780], 99.50th=[13566], 99.90th=[16450], 99.95th=[18220],
     | 99.99th=[26608]
   bw (  KiB/s): min= 2968, max= 4697, per=12.53%, avg=4180.15, stdev=213.54, samples=958
   iops        : min=  742, max= 1174, avg=1044.93, stdev=53.43, samples=958
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.05%
  lat (msec)   : 2=0.01%, 4=0.12%, 10=83.28%, 20=16.51%, 50=0.03%
  cpu          : usr=1.83%, sys=8.67%, ctx=1374282, majf=0, minf=18
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=1171415,500425,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=397MiB/s (417MB/s), 397MiB/s-397MiB/s (417MB/s-417MB/s), io=16.0GiB (17.2GB), run=41245-41245msec

Run status group 1 (all jobs):
   READ: bw=329MiB/s (345MB/s), 329MiB/s-329MiB/s (345MB/s-345MB/s), io=16.0GiB (17.2GB), run=49779-49779msec

Run status group 2 (all jobs):
   READ: bw=396MiB/s (415MB/s), 396MiB/s-396MiB/s (415MB/s-415MB/s), io=16.0GiB (17.2GB), run=41372-41372msec

Run status group 3 (all jobs):
  WRITE: bw=148MiB/s (155MB/s), 148MiB/s-148MiB/s (155MB/s-155MB/s), io=8863MiB (9294MB), run=60001-60001msec

Run status group 4 (all jobs):
  WRITE: bw=142MiB/s (149MB/s), 142MiB/s-142MiB/s (149MB/s-149MB/s), io=8526MiB (8940MB), run=60009-60009msec

Run status group 5 (all jobs):
   READ: bw=142MiB/s (149MB/s), 142MiB/s-142MiB/s (149MB/s-149MB/s), io=8542MiB (8957MB), run=60001-60001msec

Run status group 6 (all jobs):
   READ: bw=140MiB/s (147MB/s), 140MiB/s-140MiB/s (147MB/s-147MB/s), io=8417MiB (8826MB), run=60009-60009msec

Run status group 7 (all jobs):
   READ: bw=76.3MiB/s (79.0MB/s), 76.3MiB/s-76.3MiB/s (79.0MB/s-79.0MB/s), io=4576MiB (4798MB), run=60005-60005msec
  WRITE: bw=32.6MiB/s (34.2MB/s), 32.6MiB/s-32.6MiB/s (34.2MB/s-34.2MB/s), io=1955MiB (2050MB), run=60005-60005msec

Disk stats (read/write):
  nvme0n1: ios=5553674/4968076, merge=0/151, ticks=598368/856272, in_queue=1451008, util=96.43%